import { toBn } from "./utils";

export const anaOptions = [
  { v: 0, t: "আনা-০" },
  { v: 1, t: "⁄ = ১ আনা" },
  { v: 2, t: "৵ = ২ আনা" },
  { v: 3, t: "৶ = ৩ আনা" },
  { v: 4, t: "৷ = ৪ আনা" },
  { v: 5, t: "৷⁄ = ৫ আনা" },
  { v: 6, t: "৷৵ = ৬ আনা" },
  { v: 7, t: "৷৶ = ৭ আনা" },
  { v: 8, t: "৷৷ = ৮ আনা" },
  { v: 9, t: "৷৷⁄ = ৯ আনা" },
  { v: 10, t: "৷৷৵ = ১০ আনা" },
  { v: 11, t: "৷৷৶ = ১১ আনা" },
  { v: 12, t: "৸ = ১২ আনা" },
  { v: 13, t: "৸⁄ = ১৩ আনা" },
  { v: 14, t: "৸৵ = ১৪ আনা" },
  { v: 15, t: "৸৶ = ১৫ আনা" },
  { v: 16, t: "১৬ আনা (১)" },
];

export const gondaOptions = [
  { v: 0, t: "গন্ডা-০" },
  ...Array.from({ length: 19 }, (_, i) => ({
    v: i + 1,
    t: `${toBn(i + 1)} গন্ডা`,
  })),
];

export const koraOptions = [
  { v: 0, t: "কড়া-০" },
  { v: 1, t: "৷ = ১ কড়া" },
  { v: 2, t: "৷৷ = ২ কড়া" },
  { v: 3, t: "৸ = ৩ কড়া" },
];

export const krantiOptions = [
  { v: 0, t: "ক্রান্তি-০" },
  { v: 1, t: "৴ = ১ ক্রান্তি" },
  { v: 2, t: "৴৴ = ২ ক্রান্তি" },
];

export const tilOptions = [
  { v: 0, t: "তিল-০" },
  ...Array.from({ length: 19 }, (_, i) => ({
    v: i + 1,
    t: `${toBn(i + 1)} তিল`,
  })),
];
